범주형 현수 --> OneHotEncoder --> 이항변수화 (0 or 1)  
성별 (남:0 , 여:1) --> 남 :01 , 여 : 10  
나이 (20대:0, 30대:1, 40대:2) -->

In [1]:
from sklearn.preprocessing import OneHotEncoder
import numpy as np
import pandas as pd
# 범주형 변수를 이항변수로 만들기 위해서

<frozen importlib._bootstrap>:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 192 from C header, got 216 from PyObject

In [3]:
# 학생 ID ,성별 ,연령대, 성적

# ID : sn_1 ~sn_5
# Gender : 'm' , 'f'
# Age : 20대(0) , -- , 40대(2)
# Grade : A , -- , F

data = np.array([[0,0,0],
         [0,1,1],
         [0,2,2], # 남자,40대,C학점
         [1,0,3],
         [1,1,4]])
data

array([[0, 0, 0],
       [0, 1, 1],
       [0, 2, 2],
       [1, 0, 3],
       [1, 1, 4]])

In [ ]:
# 1,0,3 ==> 01 100 00010
# 1,1,4 ==> 01 010 00001

In [4]:
ohe=OneHotEncoder()
ohe.fit(data) # fitting-적합시킨다

OneHotEncoder()

In [6]:
ohe.transform(data).toarray()

array([[1., 0., 1., 0., 0., 1., 0., 0., 0., 0.],
       [1., 0., 0., 1., 0., 0., 1., 0., 0., 0.],
       [1., 0., 0., 0., 1., 0., 0., 1., 0., 0.],
       [0., 1., 1., 0., 0., 0., 0., 0., 1., 0.],
       [0., 1., 0., 1., 0., 0., 0., 0., 0., 1.]])

__Binerizer : 연속형 변수 -> 이항변수화 or digitize() , np.where()__  
__OneHotEncoder : 범주형 데이터 -> 이항변수화__

In [8]:
np.random.seed(11)

In [27]:
df=pd.DataFrame({
    'C1':np.random.randn(20),
    'C2':list('a'*10+'b'*10)
})
df

          C1 C2
0   1.095630  a
1  -0.309577  a
2   0.725752  a
3   1.549072  a
4   0.630080  a
5   0.073493  a
6   0.732271  a
7  -0.642575  a
8  -0.178093  a
9  -0.573955  a
10 -0.204375  b
11 -0.486495  b
12 -0.185775  b
13 -0.380536  b
14  0.088978  b
15  0.063672  b
16  0.296347  b
17  1.402771  b
18 -1.546863  b
19  1.295619  b

In [10]:
print(df['C1'].max(),df['C1'].min())

1.7494547413051793 -2.653318559261479

In [13]:
Bins=np.linspace(df['C1'].min(),df['C1'].max(),10)
Bins

array([-2.65331856, -2.16412153, -1.67492449, -1.18572746, -0.69653043,
       -0.20733339,  0.28186364,  0.77106067,  1.26025771,  1.74945474])

In [15]:
df['C1_bin']=np.digitize(df['C1'],bins=Bins)
df.head(2)

         C1 C2  C1_bin
0  1.749455  a      10
1 -0.286073  a       5

In [16]:
df.groupby(['C1_bin'])['C1'].mean()

C1_bin
1    -2.653319
3    -1.305549
4    -1.023773
5    -0.464346
6    -0.019680
7     0.544833
9     1.574634
10    1.749455
Name: C1, dtype: float64

In [17]:
df.groupby(['C1_bin'])['C2'].value_counts()

C1_bin  C2
1       a     1
3       b     1
4       b     2
        a     1
5       a     4
        b     2
6       a     1
        b     1
7       b     3
        a     2
9       b     1
10      a     1
Name: C2, dtype: int64

In [19]:
# df의 C1_bin 의 값이 2와 같은 데이터만 출력
df[df['C1_bin']==5]

          C1 C2  C1_bin
1  -0.286073  a       5
2  -0.484565  a       5
5  -0.319631  a       5
6  -0.536629  a       5
11 -0.475733  b       5
19 -0.683447  b       5

__get_dummies()__

In [21]:
fruit=pd.DataFrame({
    'name':['apple','banana','cherry','durian',np.nan],
    'color':['red','yellow','red','green',np.nan]
})
fruit

     name   color
0   apple     red
1  banana  yellow
2  cherry     red
3  durian   green
4     NaN     NaN

In [22]:
pd.get_dummies(fruit['name'])  # nan 은 포함이 안된다.

   apple  banana  cherry  durian
0      1       0       0       0
1      0       1       0       0
2      0       0       1       0
3      0       0       0       1
4      0       0       0       0

In [24]:
pd.get_dummies(fruit)  # nan 도 설정이 되긴함?

,name_apple,name_banana,name_cherry,name_durian,color_green,color_red,color_yellow
0,1,0,0,0,0,1,0
1,0,1,0,0,0,0,1
2,0,0,1,0,0,1,0
3,0,0,0,1,1,0,0
4,0,0,0,0,0,0,0

In [25]:
pd.get_dummies(fruit,columns=['name'],dummy_na=True)  # 거의 없긴하지만 nan도 포함해서 인코딩하는 방법

    color  name_apple  name_banana  name_cherry  name_durian  name_nan
0     red           1            0            0            0         0
1  yellow           0            1            0            0         0
2     red           0            0            1            0         0
3   green           0            0            0            1         0
4     NaN           0            0            0            0         1

In [28]:
# np.where 를 이용한 연속형 -> 이산형
# c1열의 평균값보다 크면 'high' , 작으면 'low' -> df['high_low'] 열 생성

df['high_low'] = np.where(df['C1']>df['C1'].mean(),'high','low')
df.head(3)

         C1 C2 high_low
0  1.095630  a     high
1 -0.309577  a      low
2  0.725752  a     high

In [29]:
# df 의 high_low 열로 그룹화 후 각 그룹 크기 출력
df.groupby(['high_low']).size()

high_low
high     8
low     12
dtype: int64

# 오후

In [30]:
# 데이터 재구조화 : pivot_table , stack , unstack , melt , wide_to_long

pivot : df.pivot(index,columns,values)  
pivot_table : df.pivot_table(data,index,columns,values)

In [31]:
data = pd.DataFrame({'cust_id': ['c1', 'c1', 'c1', 'c2', 'c2', 'c2', 'c3', 'c3', 'c3'],
   'prod_cd': ['p1', 'p2', 'p3', 'p1', 'p2', 'p3', 'p1', 'p2', 'p3'],
   'grade' : ['A', 'A', 'A', 'A', 'A', 'A', 'B', 'B', 'B'],
   'pch_amt': [30, 10, 0, 40, 15, 30, 0, 0, 10]})
data

  cust_id prod_cd grade  pch_amt
0      c1      p1     A       30
1      c1      p2     A       10
2      c1      p3     A        0
3      c2      p1     A       40
4      c2      p2     A       15
5      c2      p3     A       30
6      c3      p1     B        0
7      c3      p2     B        0
8      c3      p3     B       10

In [35]:
data_pivot = data.pivot(index='cust_id',columns='prod_cd',values='pch_amt')
data_pivot

prod_cd  p1  p2  p3
cust_id
c1       30  10   0
c2       40  15  30
c3        0   0  10

In [32]:
data.pivot_table('pch_amt',index=['cust_id'],columns=['prod_cd'])

prod_cd  p1  p2  p3
cust_id
c1       30  10   0
c2       40  15  30
c3        0   0  10

__pivot_table 은 되는데 pivot 함수는 지원하지 않는 기능__  
* 2 이상의 인덱스, 컬럼 종류  
* agg func 적용 X  ==> 'Index contains duplicate entries, cannot reshape'  
---
__agg function (집계함수) - 피봇팅 행,열을 설정했을 때 '값' 부분에 들어갈 데이터가 여러개일 경우 처리방법을 정해주어야함__  
ex) sum, mean, std 등등

In [40]:
# index = cust_id , grade
# columns = prod_cd
# values = pch_amt

#data.pivot(index=['cust_id','grade'],columns='prod_cd',values='pch_amt')
data.pivot_table(index=['cust_id','grade'],columns='prod_cd',values='pch_amt')

prod_cd        p1  p2  p3
cust_id grade
c1      A      30  10   0
c2      A      40  15  30
c3      B       0   0  10

In [41]:
data.pivot_table(index=['cust_id'],columns=['grade','prod_cd'],values=['pch_amt'])

        pch_amt
grade         A                B
prod_cd      p1    p2    p3   p1   p2    p3
cust_id
c1         30.0  10.0   0.0  NaN  NaN   NaN
c2         40.0  15.0  30.0  NaN  NaN   NaN
c3          NaN   NaN   NaN  0.0  0.0  10.0

In [47]:
data.pivot_table(index='grade',columns='prod_cd',values='pch_amt',aggfunc=np.sum)

prod_cd  p1  p2  p3
grade
A        70  25  30
B         0   0  10

In [48]:
# margin 옵션 행,열 둘다 적용하는? 옵션
data.pivot_table(index='grade',columns='prod_cd',values='pch_amt',aggfunc=np.sum,margins=True)

prod_cd  p1  p2  p3  All
grade
A        70  25  30  125
B         0   0  10   10
All      70  25  40  135